performance/graphql-read-load-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  ensure:
    p95: 500
    maxErrorRate: 1
  plugins:
    metrics-by-endpoint:
      stripQueryString: true

scenarios:
  - name: "List campaigns (read-heavy)"
    weight: 40
    flow:
      - post:
          url: "/graphql"
          json:
            query: |
              query ListCampaigns($limit: Int!) {
                campaigns(limit: $limit) {
                  id
                  title
                  goal
                  totalRaised
                  status
                }
              }
            variables:
              limit: 20

  - name: "Campaign detail"
    weight: 30
    flow:
      - post:
          url: "/graphql"
          json:
            query: |
              query CampaignDetail($id: ID!) {
                campaign(id: $id) {
                  id
                  title
                  description
                  goal
                  totalRaised
                  deadline
                  status
                  creator
                  contributorCount
                }
              }
            variables:
              id: "test-campaign-001"

  - name: "Search campaigns"
    weight: 20
    flow:
      - post:
          url: "/graphql"
          json:
            query: |
              query SearchCampaigns($query: String!, $limit: Int!) {
                searchCampaigns(query: $query, limit: $limit) {
                  id
                  title
                  totalRaised
                  status
                }
              }
            variables:
              query: "tech"
              limit: 10

  - name: "Platform stats"
    weight: 10
    flow:
      - post:
          url: "/graphql"
          json:
            query: |
              query Stats {
                stats {
                  totalCampaigns
                  totalRaised
                  totalContributors
                }
              }